Revit 2026 API

# ExporterIFCUtilsSetGlobal3DOriginHandle Method

---

Sets the handle representing the 3D origin.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetGlobal3DOriginHandle(
	IFCAnyHandle origin
)
```
```vb
Public Shared Sub SetGlobal3DOriginHandle (
	origin As IFCAnyHandle
)
```
```cpp
public:
static void SetGlobal3DOriginHandle(
	IFCAnyHandle^ origin
)
```
```fsharp
static member SetGlobal3DOriginHandle :
        origin : IFCAnyHandle -> unit
```

#### Parameters

origin IFCAnyHandle
     The origin handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace